import React from 'react';
import '../styles.css';
import person1 from '../assets/person1.jpg';


function ReviewSection() {
    return (
        <section className="review-section">
            <div className="container review-container">
                <h2>Как мы работаем</h2>
                <div className="work-steps">
                  <div className="work-step">
                    <span className="step-icon">24</span>
                    <p>Мы работаем круглосуточно и с удовольствием.</p>
                  </div>
                  <div className="work-step">
                    <span className="step-icon">
                      <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M15.59 10.98C15.59 11.88 14.86 12.61 13.97 12.61C13.08 12.61 12.35 11.88 12.35 10.98C12.35 10.08 13.08 9.35 13.97 9.35C14.86 9.35 15.59 10.08 15.59 10.98ZM6.28 10.98C6.28 11.88 5.55 12.61 4.66 12.61C3.77 12.61 3.04 11.88 3.04 10.98C3.04 10.08 3.77 9.35 4.66 9.35C5.55 9.35 6.28 10.08 6.28 10.98ZM19.7 10.98C19.7 11.88 18.97 12.61 18.08 12.61C17.19 12.61 16.46 11.88 16.46 10.98C16.46 10.08 17.19 9.35 18.08 9.35C18.97 9.35 19.7 10.08 19.7 10.98Z" fill="#0166FF"/>
                        <path d="M12 21C16.97 21 21 16.97 21 12C21 7.03 16.97 3 12 3C7.03 3 3 7.03 3 12C3 16.97 7.03 21 12 21ZM12 23C18.075 23 23 18.075 23 12C23 5.925 18.075 1 12 1C5.925 1 1 5.925 1 12C1 18.075 5.925 23 12 23Z" fill="#0166FF"/>
                      </svg>

                    </span>
                    <p>НИЖНИЕ ЦЕНЫ</p>
                    <p>Мы не гонимся за прибылью. Мы просто делаем своё дело.</p>
                  </div>
                  <div className="work-step">
                    <span className="step-icon">
                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M12 12.5C13.01 12.5 13.85 11.98 14.33 11.23L20.24 2.85C20.63 2.27 20.14 1.5 19.43 1.5H4.57C3.86 1.5 3.37 2.27 3.76 2.85L9.67 11.23C10.15 11.98 10.99 12.5 12 12.5Z" fill="#0166FF"/>
                      <path fillRule="evenodd" clipRule="evenodd" d="M14.33 11.23L20.24 2.85C20.63 2.27 20.14 1.5 19.43 1.5H4.57C3.86 1.5 3.37 2.27 3.76 2.85L9.67 11.23C10.15 11.98 10.99 12.5 12 12.5C13.01 12.5 13.85 11.98 14.33 11.23ZM12 14.5C10.73 14.5 9.7 13.47 9.7 12.2V11.23L3.76 2.85C3.37 2.27 3.86 1.5 4.57 1.5H19.43C20.14 1.5 20.63 2.27 20.24 2.85L14.33 11.23V12.2C14.33 13.47 13.3 14.5 12 14.5ZM12 23C16.97 23 21 18.97 21 14C21 9.03 16.97 5 12 5C7.03 5 3 9.03 3 14C3 18.97 7.03 23 12 23ZM12 24C18.075 24 23 18.075 23 12C23 5.925 18.075 1 12 1C5.925 1 1 5.925 1 12C1 18.075 5.925 24 12 24Z" fill="#0166FF"/>
                    </svg>
                    </span>
                    <p>СКИДКИ</p>
                    <p>В выходные и праздничные дни действуют скидки 13%</p>
                  </div>
                  <div className="work-step">
                    <span className="step-icon">
                      <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M16 10.5C16 11.88 14.88 13 13.5 13C12.12 13 11 11.88 11 10.5C11 9.12 12.12 8 13.5 8C14.88 8 16 9.12 16 10.5ZM8 10.5C8 11.88 6.88 13 5.5 13C4.12 13 3 11.88 3 10.5C3 9.12 4.12 8 5.5 8C6.88 8 8 9.12 8 10.5ZM13.5 23C19.7 23 23 17.55 23 10.5C23 3.45 19.7 1 13.5 1C7.3 1 4 3.45 4 10.5C4 17.55 7.3 23 13.5 23ZM13.5 24C20.2 24 24 17.78 24 10.5C24 3.22 20.2 0 13.5 0C6.8 0 3 3.22 3 10.5C3 17.78 6.8 24 13.5 24Z" fill="#0166FF"/>
                      </svg>
                    </span>
                    <p>МЕНЕДЖЕРЫ</p>
                    <p>Вежливые менеджеры подберут оптимальное решение</p>
                  </div>
                </div>
                </div>
              <img src={person1} alt="Мужчина с женщиной" className="review-image" />
        </section>
    );
}

export default ReviewSection;